from typing import Final, Dict, List, Tuple

NA : Final[str] = '' # порожня ячейка, інформація не додана або не змогли витягнути
UA_QUOTE = "'"

TASK_TYPES: Final[Dict[str, str]] = {
    'Документація': 'description',
    'Запити': 'contact_support',
    'Фікс Даних': 'bug_report',
    'Програмірувай': 'flutter_dash',
    'Звіти': 'menu_book'
}

VALID_PATTERN_PHONE= r'^(?:\+380|380|0)\d{9}$'
VALID_PATTERN_ID_NUMBER= r'^\d{10}$'
VALID_PATTERN_DATE = r'^(?:0[1-9]|[12]\d|3[01])\.(?:0[1-9]|1[0-2])\.(?:19[6-9]\d|[2-9]\d{3})$'
VALID_PATTERN_EMAIL = r'^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$'

REGEX_ANSWERS = [
    (r"(привіт|бажаю|міцного|здоров|вітаю|куку|вечір в хату|хай|доброго|добридень|бонжур)",
     ["Привіт! Що трапилося? 🤖", "Бажаю міцного! Я на зв'язку. 🫡", "Вітаю! Слухаю уважно.", "Вечір в хату", "Доброго раночку з кавочкой", "Здоровенькі були та й будьмо!"]),
    (r"(салют)",
     ["Тільки без фєєрверків!"]),

    (r"(на все добре|пока|побачення|до завтра|будьмо)",
     ["На все добре! 🤖", "Тихої ночі. 🫡", "Я пішов спатки.", "Будьмо!"]),

    (r"(спасибо|дяка|дякую|подякував|вдячний|молодець)",
     ["Я вас умоляю, куме! 🤖", "Бубьласка. 🫡", "Радий допомогти.", "Мій процесор задоволено мурчить!"]),

    (r"(як справи|шо там|як воно|як сам)",
     ["Сракопад жахливий! 🚀", "Тримаємось на багах та каві. ☕", "Все стабільно: факапи за розкладом.", "4.5.0!"]),

    (r"(хто ти|що ти за звір|ти хто|ти що)",
     ["Я бот-ботяра-саботяра, повний шаїчечки та багів. 🛠️","Налий кави, відповім", "В мене два кота!"]),

    (r"(скучно|нудно|що робити)",
     ["Знайди лопату і копай! ⛏️", "Візьми Статут, почитай на ніч.", "Почисти зброю ще раз.", "Скучно йому... Радій, що тихо!", "Запропонуй свою допомогу старшині."]),

    (r"(перемога|коли перемога|кінець війни)",
     ["Працюємо над цим кожного дня.", "Вір в Бога та ЗСУ.", "Разом і до кінця.", "Скоро. Але це не точно. 2-3 тижня (С)"]),

    (r"(капець|піпець|жесть|йомайо|бляха|пизд)",
     ["Такова селяві, друже. 🤷‍♂️", "Тримаймо стрій, навіть якщо це повна...", "Глибше дихай.", "І не таке бувало.", "Зберись, тряпка!"]),

    (r"(допомо|help)",
     ["Ага, здайосі? Напиши 'меню' і погнали"]),

    (r"(паляниця|укрзалізниця)",
     ["Укрзалізниця! 🇺🇦"]),

    (r"(слава україні|героям слава)",
     ["Героям Слава! 🇺🇦"]),

    (r"(слава нації)",
     ["Смерть ворогам! 🇺🇦"])

]
